Infineon/cmsis_packs/XMC1000/Infineon.XMC1000_DFP.pdsc
    <condition id="XMC1301_Q24">                                     
      <description>Infineon XMC1301 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q024*"/>      
    </condition>    
    
    <condition id="XMC1301_Q40">                                     
      <description>Infineon XMC1201  series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q040*"/>      
    </condition>

    <condition id="XMC1301_T16">                                     
      <description>Infineon XMC1301 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T016*"/>      
    </condition>    

    <condition id="XMC1301_T38">                                     
      <description>Infineon XMC1301 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T038*"/>      
    </condition>
    
    <condition id="XMC1302_Q24">                                     
      <description>Infineon XMC1302 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q024*"/>      
    </condition>        

    <condition id="XMC1302_Q40">                                     
      <description>Infineon XMC1302 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q040*"/>      
    </condition>

    <condition id="XMC1302_T16">                                     
      <description>Infineon XMC1302 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T016*"/>      
    </condition>    

    <condition id="XMC1302_T28">                                     
      <description>Infineon XMC1302 series TSSOP28</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T028*"/>      
    </condition>

    <condition id="XMC1302_T38">                                     
      <description>Infineon XMC1302 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T038*"/>      
    </condition>

    <condition id="XMC13xx ARM">                                     
      <description>Infineon XMC13xx series and ARMCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="ARMCC"/>    
    </condition> 

    <condition id="XMC13xx IAR">                                     
      <description>Infineon XMC13xx series and IAR compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="IAR"/>    
    </condition> 

    <condition id="XMC13xx GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="GCC"/>    
    </condition> 
    
    <condition id="XMC13xx_0008_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0008"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0016_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0016"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0032_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0032"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0064_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0064"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0128_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0128"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0200_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0200"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx">                                     
      <description>Infineon XMC13xx series</description>
      <accept condition="XMC13xx ARM"/>
      <accept condition="XMC13xx IAR"/>   
      <accept condition="XMC13xx GCC"/>   
    </condition>
  
    <condition id="XMC1401_Q48">                                     
      <description>Infineon XMC1401 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1401-Q048*"/>      
    </condition>

