Infineon/cmsis_packs/XMC1000/Infineon.XMC1000_DFP.pdsc
    <condition id="XMC1401_F64">                                     
      <description>Infineon XMC1401 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1401-F064*"/>      
    </condition>

    <condition id="XMC1402_T38">                                     
      <description>Infineon XMC1402 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-T038*"/>      
    </condition>

    <condition id="XMC1402_Q40">                                     
      <description>Infineon XMC1402 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q040*"/>      
    </condition>

    <condition id="XMC1402_Q48">                                     
      <description>Infineon XMC1402 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q048*"/>      
    </condition>

    <condition id="XMC1402_Q64">                                     
      <description>Infineon XMC1402 series VFQN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q064*"/>      
    </condition>

    <condition id="XMC1402_F64">                                     
      <description>Infineon XMC1402 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-F064*"/>      
    </condition>

    <condition id="XMC1403_Q40">                                     
      <description>Infineon XMC1403 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1403-Q040*"/>      
    </condition>

    <condition id="XMC1403_Q48">                                     
      <description>Infineon XMC1403 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1403-Q048*"/>      
    </condition>

    <condition id="XMC1403_Q64">                                     
      <description>Infineon XMC1402 series VQFN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1403-Q064*"/>      
    </condition>

    <condition id="XMC1404_Q48">                                     
      <description>Infineon XMC1404 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-Q048*"/>      
    </condition>

    <condition id="XMC1404_Q64">                                     
      <description>Infineon XMC1404 series VQFN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-Q064*"/>      
    </condition>

    <condition id="XMC1404_F64">                                     
      <description>Infineon XMC1404 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-F064*"/>      
    </condition>

    <condition id="XMC1401 ARM">                                     
      <description>Infineon XMC1401 LEDTS series and ARMCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <require Tcompiler="ARMCC"/>    
    </condition> 

    <condition id="XMC1401 IAR">                                     
      <description>Infineon XMC1401 LEDTS series and IAR compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <require Tcompiler="IAR"/>    
    </condition>

    <condition id="XMC1401 GCC">                                     
      <description>Infineon XMC1401 LEDTS series and GCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <require Tcompiler="GCC"/>    
    </condition>
  
    <condition id="XMC1401">                                     
      <description>Infineon XMC1401 series</description>
      <accept condition="XMC1401 ARM"/>
      <accept condition="XMC1401 IAR"/>   
      <accept condition="XMC1401 GCC"/>   
    </condition>
  
    <condition id="XMC1402 ARM">                                     
      <description>Infineon XMC1402 Control series and ARMCC compiler</description>
      <accept condition="XMC1402_T38"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <require Tcompiler="ARMCC"/>      
    </condition> 

    <condition id="XMC1402 IAR">                                     
      <description>Infineon XMC1402 Control series and ARMCC compiler</description>
      <accept condition="XMC1402_T38"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <require Tcompiler="IAR"/>      
    </condition> 

    <condition id="XMC1402 GCC">                                     
      <description>Infineon XMC1402 Control series and GCC compiler</description>
      <accept condition="XMC1402_T38"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <require Tcompiler="GCC"/>      
    </condition> 

    <condition id="XMC14xx_0032_GCC">                                     
      <description>Infineon XMC14xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0032"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC14xx_0064_GCC">                                     
      <description>Infineon XMC14xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0064"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC14xx_0128_GCC">                                     
      <description>Infineon XMC14xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0128"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC14xx_0200_GCC">                                     
      <description>Infineon XMC14xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0200"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC1402">                                     
      <description>Infineon XMC1402 series</description>
      <accept condition="XMC1402 ARM"/>
      <accept condition="XMC1402 IAR"/>   
      <accept condition="XMC1402 GCC"/>   
    </condition>  
  
    <condition id="XMC1403 ARM">                                     
      <description>Infineon XMC1403 CAN series and ARMCC compilert</description>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
     <require Tcompiler="ARMCC"/>     
    </condition> 

    <condition id="XMC1403 IAR">                                     
      <description>Infineon XMC1403 CAN series and IAR compilert</description>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <require Tcompiler="IAR"/>      
    </condition> 

    <condition id="XMC1403 GCC">                                     
      <description>Infineon XMC1403 CAN series and GCC compilert</description>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <require Tcompiler="GCC"/>     
    </condition> 

    <condition id="XMC1403">                                     
      <description>Infineon XMC1403 series</description>
      <accept condition="XMC1403 ARM"/>
      <accept condition="XMC1403 IAR"/>   
      <accept condition="XMC1403 GCC"/>   
    </condition>
  
