Infineon/cmsis_packs/XMC1000/Infineon.XMC1000_DFP.pdsc
    <!-- Board Support Pack (BSP) for XMC1300 Boot Kit -->   
    <bundle Cbundle="XMC1300 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1300 Boot Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1300 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1300 Boot Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="A/D Converter" condition="XMC1 HAL VADC">
        <description>A/D Converter interface for XMC1300 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1300 Boot Kit/Common/ADC.c"/>
        </files>
      </component>
    </bundle>

    <!-- Board Support Pack (BSP) for XMC1400 Boot Kit -->   
    <bundle Cbundle="XMC1400 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1400 Boot Kit Board Support</description>    
      <doc>Documents/Infineon-Board_Users_Manual_XMC1400_Boot_Kit.pdf-UM-v01_00-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1400 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1400 Boot Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="A/D Converter" condition="XMC1 HAL VADC">
        <description>A/D Converter interface for XMC1400 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1400 Boot Kit/Common/ADC.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
